# 生成 case 菜单


while True:
    print("***************主菜单***************")
    nu = input("请选择关卡：\n1.线路模块\n2.键盘模块\n**********************************\n")
    while True:
        if nu == "1":
            print("*******************线路模块*******************")
            import _线路模块
            _线路模块.main()

            t = input("输入 y 返回主菜单，输入其他任意键留在当前模块\n")
            if t == "y":
                break
        elif nu == "2":
            print("*******************键盘模块*******************")
            import _键盘模块
            _键盘模块.main()

            t = input("输入 y 返回主菜单，输入其他任意键留在当前模块\n")
            if t == "y":
                break
